W4D3/skeleton/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if current_user && current_user.id != @rental_request.cat.owner.id
      @rental_request.user_id = current_user.id
      if @rental_request.save