W4D3/skeleton/app/controllers/cats_controller.rb

  def show
    @cat = Cat.where(id: params[:id]).includes(:rental_requests).first
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = 1  ORDER BY "cats"."id" ASC LIMIT 1
SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @cat.update_attributes(cat_params)
---
UPDATE "cats" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = 1  [["description", "Joe cat!"], ["name", "NotJoeCat"], ["updated_at", "2016-11-09 20:22:16.098271"]]