W4D3/skeleton/app/controllers/users_controller.rb

  def create
    # user = User.find_by_credentials(
    #   params[:user][:user_name],
    #   params[:user][:password]
    # )
    user = User.new(users_params)
    if user.save
---
INSERT INTO "users" ("password_digest", "session_token", "user_name") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$k.Bi9gw/UOIzY4nCWLPXQ.CQrck7l1fvKQRfWOfvAp14BbjCFgxSC"], ["session_token", "QoTLu-bP-FPOpwPabdMroQ"], ["user_name", "test"]]